SLS/src/InformationRegisters/УС_ОчередьПочта/УС_ОчередьПочта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УС_ОчередьПочта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресатДоставки</name>
    <comment>Email</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Копии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытыеКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысокаяВажность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПопыткиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСохраняемогоФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаCDO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКому</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SLS/src/CommonModules/_МАА_Процедуры/Module.bsl
Функция ЭтоРабочаяБаза() Экспорт
	
	ЭтоРаб =
		СтрНайти(НРег(СтрокаСоединенияИнформационнойБазы()), "ref=""sdoplog"";") > 0
		И НЕ РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована();
	
	Возврат ЭтоРаб;
	
КонецФункции

Функция УдалитьНедопустимыеСимволы(ОбрабатываемаяСтрока) Экспорт
	
	Стр = ОбрабатываемаяСтрока;
	СтрокаЗамены = "<>/\*?:|«»"""+Символы.Таб+Символы.НПП;
	Для Ном=1 по СтрДлина(СтрокаЗамены) Цикл
		Стр = СтрЗаменить(Стр, Сред(СтрокаЗамены, Ном, 1), " ");	
	КонецЦикла;
	
	Возврат Стр;
	
КонецФункции


Процедура _ОтложеннаяОтправкаПисем() Экспорт

	ЗамерВеремни = ОценкаПроизводительности.НачатьЗамерВремени();
		
	ТекущаяДата = ТекущаяДата(); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УС_ОчередьПочта.Период КАК Период,
	|	УС_ОчередьПочта.Документ КАК Документ,
	|	УС_ОчередьПочта.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	УС_ОчередьПочта.Отправитель КАК Отправитель,
	|	УС_ОчередьПочта.КогдаОтправить КАК КогдаОтправить,
	|	УС_ОчередьПочта.АдресатДоставки КАК АдресатДоставки,
	|	УС_ОчередьПочта.Копии КАК Копии,
	|	УС_ОчередьПочта.СкрытыеКопии КАК СкрытыеКопии,
	|	УС_ОчередьПочта.Тема КАК Тема,
	|	УС_ОчередьПочта.Текст КАК Текст,
	|	УС_ОчередьПочта.ВысокаяВажность КАК ВысокаяВажность,
	|	УС_ОчередьПочта.ПредставлениеОтправителя КАК ПредставлениеОтправителя,
	|	УС_ОчередьПочта.ПутьКФайлу КАК ПутьКФайлу,
	|	УС_ОчередьПочта.ИмяСохраняемогоФайла КАК ИмяСохраняемогоФайла,
	|	УС_ОчередьПочта.КоличествоПопытокОтправки КАК КоличествоПопытокОтправки,
	|	УС_ОчередьПочта.ДатаПопыткиОтправки КАК ДатаПопыткиОтправки,
	|	УС_ОчередьПочта.ОтправкаCDO КАК ОтправкаCDO,
	|	УС_ОчередьПочта.ОтветКому КАК ОтветКому,
	|	УС_ОчередьПочта.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	УС_ОчередьПочта.ИдентификаторыОснований КАК ИдентификаторыОснований
	|ИЗ
	|	РегистрСведений.УС_ОчередьПочта КАК УС_ОчередьПочта
	|ГДЕ
	|	НЕ УС_ОчередьПочта.Отправлено
	|	И НЕ УС_ОчередьПочта.ОшибкаОтправки
	|	И УС_ОчередьПочта.КогдаОтправить МЕЖДУ &ДатаНач И &ДатаКон
	|
	|УПОРЯДОЧИТЬ ПО
	|	КогдаОтправить";
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ДанныеНаОтправку = РезультатЗапроса.Скопировать();
	ДанныеНаОтправку.Очистить();
	Для каждого Стр из  РезультатЗапроса Цикл
		Если НачалоДня(Стр.КогдаОтправить) = НачалоДня(ТекущаяДата) Тогда
			Если ТекущаяДата >= Стр.КогдаОтправить  Тогда
				
				НовСтр = ДанныеНаОтправку.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если ДанныеНаОтправку.Количество() > 0 Тогда
		
		РегистрыСведений.УС_ОчередьПочта.ОтправитьПисьма(ДанныеНаОтправку);
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("Регламент._УС_ОтложеннаяОтправкаПисем", ЗамерВеремни, ДанныеНаОтправку.Количество());
		
	КонецЕсли;	
	
КонецПроцедуры
